EMCLab-Sinica/Intermittent-Distributed/Connectivity/CC1101_MSP430.c
static const uint8_t CC1101_GFSK_100_kb[] = {
    0x07, // IOCFG2        GDO2 Output Pin Configuration
    0x2E, // IOCFG1        GDO1 Output Pin Configuration
    0x80, // IOCFG0        GDO0 Output Pin Configuration
    0x07, // FIFOTHR       RX FIFO and TX FIFO Thresholds
    0x57, // SYNC1         Sync Word, High Byte
    0x43, // SYNC0         Sync Word, Low Byte
    0x3E, // PKTLEN        Packet Length
    0x0E, // PKTCTRL1      Packet Automation Control
    0x45, // PKTCTRL0      Packet Automation Control
    0xFF, // ADDR          Device Address
    0x00, // CHANNR        Channel Number
    0x08, // FSCTRL1       Frequency Synthesizer Control
    0x00, // FSCTRL0       Frequency Synthesizer Control
    0x21, // FREQ2         Frequency Control Word, High Byte
    0x65, // FREQ1         Frequency Control Word, Middle Byte
    0x6A, // FREQ0         Frequency Control Word, Low Byte
    0x5B, // MDMCFG4       Modem Configuration
    0xF8, // MDMCFG3       Modem Configuration
    0x13, // MDMCFG2       Modem Configuration
    0xA0, // MDMCFG1       Modem Configuration
    0xF8, // MDMCFG0       Modem Configuration
    0x47, // DEVIATN       Modem Deviation Setting
    0x07, // MCSM2         Main Radio Control State Machine Configuration
    0x0C, // MCSM1         Main Radio Control State Machine Configuration
    0x18, // MCSM0         Main Radio Control State Machine Configuration
    0x1D, // FOCCFG        Frequency Offset Compensation Configuration
    0x1C, // BSCFG         Bit Synchronization Configuration
    0xC7, // AGCCTRL2      AGC Control
    0x00, // AGCCTRL1      AGC Control
    0xB2, // AGCCTRL0      AGC Control
    0x02, // WOREVT1       High Byte Event0 Timeout
    0x26, // WOREVT0       Low Byte Event0 Timeout
    0x09, // WORCTRL       Wake On Radio Control
    0xB6, // FREND1        Front End RX Configuration
    0x17, // FREND0        Front End TX Configuration
    0xEA, // FSCAL3        Frequency Synthesizer Calibration
    0x0A, // FSCAL2        Frequency Synthesizer Calibration
    0x00, // FSCAL1        Frequency Synthesizer Calibration
    0x11, // FSCAL0        Frequency Synthesizer Calibration
    0x41, // RCCTRL1       RC Oscillator Configuration
    0x00, // RCCTRL0       RC Oscillator Configuration
    0x59, // FSTEST        Frequency Synthesizer Calibration Control,
    0x7F, // PTEST         Production Test
    0x3F, // AGCTEST       AGC Test
    0x81, // TEST2         Various Test Settings
    0x3F, // TEST1         Various Test Settings
    0x0B  // TEST0         Various Test Settings
};

static const uint8_t CC1101_MSK_250_kb[] = {
    0x07, // IOCFG2        GDO2 Output Pin Configuration
    0x2E, // IOCFG1        GDO1 Output Pin Configuration
    0x80, // IOCFG0        GDO0 Output Pin Configuration
    0x07, // FIFOTHR       RX FIFO and TX FIFO Thresholds
    0x57, // SYNC1         Sync Word, High Byte
    0x43, // SYNC0         Sync Word, Low Byte
    0x3E, // PKTLEN        Packet Length
    0x0E, // PKTCTRL1      Packet Automation Control
    0x45, // PKTCTRL0      Packet Automation Control
    0xFF, // ADDR          Device Address
    0x00, // CHANNR        Channel Number
    0x0B, // FSCTRL1       Frequency Synthesizer Control
    0x00, // FSCTRL0       Frequency Synthesizer Control
    0x21, // FREQ2         Frequency Control Word, High Byte
    0x65, // FREQ1         Frequency Control Word, Middle Byte
    0x6A, // FREQ0         Frequency Control Word, Low Byte
    0x2D, // MDMCFG4       Modem Configuration
    0x3B, // MDMCFG3       Modem Configuration
    0x73, // MDMCFG2       Modem Configuration
    0xA0, // MDMCFG1       Modem Configuration
    0xF8, // MDMCFG0       Modem Configuration
    0x00, // DEVIATN       Modem Deviation Setting
    0x07, // MCSM2         Main Radio Control State Machine Configuration
    0x0C, // MCSM1         Main Radio Control State Machine Configuration
    0x18, // MCSM0         Main Radio Control State Machine Configuration
    0x1D, // FOCCFG        Frequency Offset Compensation Configuration
    0x1C, // BSCFG         Bit Synchronization Configuration
    0xC7, // AGCCTRL2      AGC Control
    0x00, // AGCCTRL1      AGC Control
    0xB2, // AGCCTRL0      AGC Control
    0x02, // WOREVT1       High Byte Event0 Timeout
    0x26, // WOREVT0       Low Byte Event0 Timeout
    0x09, // WORCTRL       Wake On Radio Control
    0xB6, // FREND1        Front End RX Configuration
    0x17, // FREND0        Front End TX Configuration
    0xEA, // FSCAL3        Frequency Synthesizer Calibration
    0x0A, // FSCAL2        Frequency Synthesizer Calibration
    0x00, // FSCAL1        Frequency Synthesizer Calibration
    0x11, // FSCAL0        Frequency Synthesizer Calibration
    0x41, // RCCTRL1       RC Oscillator Configuration
    0x00, // RCCTRL0       RC Oscillator Configuration
    0x59, // FSTEST        Frequency Synthesizer Calibration Control,
    0x7F, // PTEST         Production Test
    0x3F, // AGCTEST       AGC Test
    0x81, // TEST2         Various Test Settings
    0x3F, // TEST1         Various Test Settings
    0x0B  // TEST0         Various Test Settings
};

static const uint8_t CC1101_MSK_500_kb[] = {
    0x07, // IOCFG2        GDO2 Output Pin Configuration
    0x2E, // IOCFG1        GDO1 Output Pin Configuration
    0x80, // IOCFG0        GDO0 Output Pin Configuration
    0x07, // FIFOTHR       RX FIFO and TX FIFO Thresholds
    0x57, // SYNC1         Sync Word, High Byte
    0x43, // SYNC0         Sync Word, Low Byte
    0x3E, // PKTLEN        Packet Length
    0x0E, // PKTCTRL1      Packet Automation Control
    0x45, // PKTCTRL0      Packet Automation Control
    0xFF, // ADDR          Device Address
    0x00, // CHANNR        Channel Number
    0x0C, // FSCTRL1       Frequency Synthesizer Control
    0x00, // FSCTRL0       Frequency Synthesizer Control
    0x21, // FREQ2         Frequency Control Word, High Byte
    0x65, // FREQ1         Frequency Control Word, Middle Byte
    0x6A, // FREQ0         Frequency Control Word, Low Byte
    0x0E, // MDMCFG4       Modem Configuration
    0x3B, // MDMCFG3       Modem Configuration
    0x73, // MDMCFG2       Modem Configuration
    0xA0, // MDMCFG1       Modem Configuration
    0xF8, // MDMCFG0       Modem Configuration
    0x00, // DEVIATN       Modem Deviation Setting
    0x07, // MCSM2         Main Radio Control State Machine Configuration
    0x0C, // MCSM1         Main Radio Control State Machine Configuration
    0x18, // MCSM0         Main Radio Control State Machine Configuration
    0x1D, // FOCCFG        Frequency Offset Compensation Configuration
    0x1C, // BSCFG         Bit Synchronization Configuration
    0xC7, // AGCCTRL2      AGC Control
    0x40, // AGCCTRL1      AGC Control
    0xB2, // AGCCTRL0      AGC Control
    0x02, // WOREVT1       High Byte Event0 Timeout
    0x26, // WOREVT0       Low Byte Event0 Timeout
    0x09, // WORCTRL       Wake On Radio Control
    0xB6, // FREND1        Front End RX Configuration
    0x17, // FREND0        Front End TX Configuration
    0xEA, // FSCAL3        Frequency Synthesizer Calibration
    0x0A, // FSCAL2        Frequency Synthesizer Calibration
    0x00, // FSCAL1        Frequency Synthesizer Calibration
    0x19, // FSCAL0        Frequency Synthesizer Calibration
    0x41, // RCCTRL1       RC Oscillator Configuration
    0x00, // RCCTRL0       RC Oscillator Configuration
    0x59, // FSTEST        Frequency Synthesizer Calibration Control,
    0x7F, // PTEST         Production Test
    0x3F, // AGCTEST       AGC Test
    0x81, // TEST2         Various Test Settings
    0x3F, // TEST1         Various Test Settings
    0x0B  // TEST0         Various Test Settings
};

static const uint8_t CC1101_OOK_4_8_kb[] = {
    0x06, // IOCFG2        GDO2 Output Pin Configuration
    0x2E, // IOCFG1        GDO1 Output Pin Configuration
    0x06, // IOCFG0        GDO0 Output Pin Configuration
    0x47, // FIFOTHR       RX FIFO and TX FIFO Thresholds
    0x57, // SYNC1         Sync Word, High Byte
    0x43, // SYNC0         Sync Word, Low Byte
    0xFF, // PKTLEN        Packet Length
    0x04, // PKTCTRL1      Packet Automation Control
    0x05, // PKTCTRL0      Packet Automation Control
    0x00, // ADDR          Device Address
    0x00, // CHANNR        Channel Number
    0x06, // FSCTRL1       Frequency Synthesizer Control
    0x00, // FSCTRL0       Frequency Synthesizer Control
    0x21, // FREQ2         Frequency Control Word, High Byte
    0x65, // FREQ1         Frequency Control Word, Middle Byte
    0x6A, // FREQ0         Frequency Control Word, Low Byte
    0x87, // MDMCFG4       Modem Configuration
    0x83, // MDMCFG3       Modem Configuration
    0x3B, // MDMCFG2       Modem Configuration
    0x22, // MDMCFG1       Modem Configuration
    0xF8, // MDMCFG0       Modem Configuration
    0x15, // DEVIATN       Modem Deviation Setting
    0x07, // MCSM2         Main Radio Control State Machine Configuration
    0x30, // MCSM1         Main Radio Control State Machine Configuration
    0x18, // MCSM0         Main Radio Control State Machine Configuration
    0x14, // FOCCFG        Frequency Offset Compensation Configuration
    0x6C, // BSCFG         Bit Synchronization Configuration
    0x07, // AGCCTRL2      AGC Control
    0x00, // AGCCTRL1      AGC Control
    0x92, // AGCCTRL0      AGC Control
    0x87, // WOREVT1       High Byte Event0 Timeout
    0x6B, // WOREVT0       Low Byte Event0 Timeout
    0xFB, // WORCTRL       Wake On Radio Control
    0x56, // FREND1        Front End RX Configuration
    0x17, // FREND0        Front End TX Configuration
    0xE9, // FSCAL3        Frequency Synthesizer Calibration
    0x2A, // FSCAL2        Frequency Synthesizer Calibration
    0x00, // FSCAL1        Frequency Synthesizer Calibration
    0x1F, // FSCAL0        Frequency Synthesizer Calibration
    0x41, // RCCTRL1       RC Oscillator Configuration
    0x00, // RCCTRL0       RC Oscillator Configuration
    0x59, // FSTEST        Frequency Synthesizer Calibration Control
    0x7F, // PTEST         Production Test
    0x3F, // AGCTEST       AGC Test
    0x81, // TEST2         Various Test Settings
    0x35, // TEST1         Various Test Settings
    0x09, // TEST0         Various Test Settings
};

//Patable index: -30  -20- -15  -10   0    5    7    10 dBm

static const uint8_t patable_power_315[] = {0x17, 0x1D, 0x26, 0x69, 0x51, 0x86, 0xCC, 0xC3};
static const uint8_t patable_power_433[] = {0x6C, 0x1C, 0x06, 0x3A, 0x51, 0x85, 0xC8, 0xC0};
static const uint8_t patable_power_868[] = {0x03, 0x17, 0x1D, 0x26, 0x50, 0x86, 0xCD, 0xC0};
static const uint8_t patable_power_915[] = {0x0B, 0x1B, 0x6D, 0x67, 0x50, 0x85, 0xC9, 0xC1};
//static uint8_t patable_power_2430[] = {0x44,0x84,0x46,0x55,0xC6,0x6E,0x9A,0xFE};

const uint8_t debug_level = 1;

//----------------------------------[END]---------------------------------------

//-------------------------[CC1101 reset function]------------------------------
void reset(void) // reset defined in CC1101 datasheet
{
    SPI_DRIVE_CSN_LOW();
    __delay_cycles(10 * CYCLE_PER_US);
    SPI_DRIVE_CSN_HIGH();
    __delay_cycles(40 * CYCLE_PER_US);

