EMCLab-Sinica/Intermittent-Distributed/Connectivity/CC1101_MSP430.c
    spi_write_strobe(SRES);
    __delay_cycles(100 * CYCLE_PER_US);
}
//-----------------------------[END]--------------------------------------------

//------------------------[set Power Down]--------------------------------------
void powerdown(void)
{
    sidle();
    spi_write_strobe(SPWD); // CC1101 Power Down
}
//-----------------------------[end]--------------------------------------------

/*
//---------------------------[WakeUp]-------------------------------------------
void wakeup(void)
{
    SPI_DRIVE_CSN_LOW();
    delayMicroseconds(10);
    SPI_DRIVE_CSN_HIGH();
    delayMicroseconds(10);
    receive();                            // go to RX Mode
}

//-----------------------------[end]--------------------------------------------
*/

//----------------------[CC1101 init functions]---------------------------------
uint8_t initRF(volatile uint8_t *my_addr)
{
    // init random seed for delay
    srand(nodeAddr);
    uint8_t CC1101_freq_select, CC1101_mode_select, CC1101_channel_select;
    uint8_t partnum, version;

    spi_init_GDO(); //setup AVR GPIO ports

    if (debug_level > 0)
    {
        print2uart("Init CC1100...");
    }

    spi_init_interface(); //inits SPI Interface
    reset();     //CC1101 init reset

    spi_write_strobe(SFTX);
    __delay_cycles(100 * CYCLE_PER_US);
    spi_write_strobe(SFRX);
    __delay_cycles(100 * CYCLE_PER_US);

    partnum = spi_read_register(PARTNUM); //reads CC1101 partnumber
    version = spi_read_register(VERSION); //reads CC1101 version number

    spi_write_register(MCSM1, 3 << 4); //FS Autocalibration

    //checks if valid Chip ID is found. Usualy 0x03 or 0x14. if not -> abort
    if (version == 0x00 || version == 0xFF)
    {
        if (debug_level > 0)
        {
            print2uart("no CC11xx found!");
        }

        return FALSE;
    }

    if (debug_level > 0)
    {
        print2uart("Part Number: %x, Version: %x\n", partnum, version);
    }

    //default settings
    // *my_addr = 0x00;
    CC1101_freq_select = 0x02; //433.92MHz
    CC1101_mode_select = 0x01; //gfsk 1.2kbps
    CC1101_channel_select = 0x01;

    //set modulation mode
    set_mode(CC1101_mode_select);

    //set ISM band
    set_ISM(CC1101_freq_select);

    //set channel
    set_channel(CC1101_channel_select);

    //set output power amplifier
    set_output_power_level(0); //set PA to 0dBm as default

    //set my receiver address
    set_myaddr(*my_addr); //set addr

    if (debug_level > 0)
    {
        print2uart("CC1101 init done.");
    }

    receive(); //set CC1101 in receive mode

    return TRUE;
}
//-------------------------------[end]------------------------------------------
void enableRFInterrupt(void)
{
    CONFIG_GDO2_RISING_EDGE_INT();
    CLEAR_GDO2_INT_FLAG();
    ENABLE_GDO2_INT();
}

//-----------------[finish's the CC1101 operation]------------------------------
void end_rf(void)
{
    powerdown(); //power down CC1101
}
//-------------------------------[end]------------------------------------------

//-----------------------[show all CC1101 registers]----------------------------
void show_register_settings(void)
{
    if (debug_level > 0)
    {
        uint8_t config_reg_verify[CFG_REGISTER], Patable_verify[CFG_REGISTER];

        spi_read_burst(READ_BURST, config_reg_verify, CFG_REGISTER); //reads all 47 config register
        spi_read_burst(PATABLE_BURST, Patable_verify, 8);            //reads output power settings
        // Serial.println(F("Cfg_reg:"));

        for (uint8_t i = 0; i < CFG_REGISTER; i++) //showes rx_buffer for debug
        {
            if (i == 9 || i == 19 || i == 29 || i == 39) //just for beautiful output style
            {
                // Serial.println();
            }
        }
        // Serial.println();
        // Serial.println(F("PaTable:"));

        for (uint8_t i = 0; i < 8; i++) //showes rx_buffer for debug
        {
            // uart_puthex_byte(Patable_verify[i]); // Serial.print(F(" "));
        }
        // Serial.println();
    }
}
//-------------------------------[end]------------------------------------------

//----------------------------[idle mode]---------------------------------------
uint8_t sidle(void)
{
    uint8_t marcstate;

    spi_write_strobe(SIDLE); //sets to idle first. must be in

    marcstate = 0xFF; //set unknown/dummy state value

    while (marcstate != 0x01) //0x01 = sidle
    {
        marcstate = (spi_read_register(MARCSTATE) & 0x1F); //read out state of CC1101 to be sure in RX
        //uart_puthex_byte(marcstate);
    }
    //// Serial.println();
    __delay_cycles(100 * CYCLE_PER_US);
    return TRUE;
}
//-------------------------------[end]------------------------------------------

//---------------------------[transmit mode]------------------------------------
uint8_t transmit(void)
{
    if (GDO0_PIN_IS_HIGH()) // channel busy
    {
        GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);      // Red LED on
        // spi_write_strobe(SFTX);    //flush TX Buffer
        vTaskDelay(rand() % 6 * 100);
        if (debug_level)
            print2uart("CCA\n");
    } else
    {
        GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);      // Red LED off
    }

    sidle();
    spi_write_strobe(STX); //sends the data over air
    uint8_t marcstate;
    marcstate = 0xFF; //set unknown/dummy state value

    //while (marcstate != 0x01) //0x01 = ILDE after sending data
    while (marcstate != 0x0D) //0x0D = RX
    {
        marcstate = (spi_read_register(MARCSTATE) & 0x1F); //read out state of CC1101 to be sure in IDLE and TX is finished
    }
    __delay_cycles(800 * CYCLE_PER_US);
    return TRUE;
}

/* No RTOS, no vTaskDelay, No CCA*/
uint8_t transmit_no_rtos(void)
{
    sidle();
    spi_write_strobe(STX); //sends the data over air
    uint8_t marcstate;
    marcstate = 0xFF; //set unknown/dummy state value

    //while (marcstate != 0x01) //0x01 = ILDE after sending data
    while (marcstate != 0x0D) //0x0D = RX
    {
        marcstate = (spi_read_register(MARCSTATE) & 0x1F); //read out state of CC1101 to be sure in IDLE and TX is finished
    }
    __delay_cycles(800 * CYCLE_PER_US);
    return TRUE;
}
//-------------------------------[end]------------------------------------------

