EMCLab-Sinica/Intermittent-Distributed/Connectivity/CC1101_MSP430.c
//---------------------------[receive mode]-------------------------------------
uint8_t receive(void)
{
    uint8_t marcstate;

    sidle();               //sets to idle first.
    spi_write_strobe(SRX); //writes receive strobe (receive mode)

    marcstate = 0xFF; //set unknown/dummy state value

    while (marcstate != 0x0D) //0x0D = RX
    {
        marcstate = (spi_read_register(MARCSTATE) & 0x1F); //read out state of CC1101 to be sure in RX
        //uart_puthex_byte(marcstate);
    }
    __delay_cycles(100 * CYCLE_PER_US);
    return TRUE;
}
//-------------------------------[end]------------------------------------------

//------------[enables WOR Mode  EVENT0 ~1890ms; rx_timeout ~235ms]--------------------
void wor_enable()
{
    /*
    EVENT1 = WORCTRL[6:4] -> Datasheet page 88
    EVENT0 = (750/Xtal)*(WOREVT1<<8+WOREVT0)*2^(5*WOR_RES) = (750/26Meg)*65407*2^(5*0) = 1.89s

                        (WOR_RES=0;RX_TIME=0)               -> Datasheet page 80
i.E RX_TIMEOUT = EVENT0*       (3.6038)      *26/26Meg = 235.8ms
                        (WOR_RES=0;RX_TIME=1)               -> Datasheet page 80
i.E.RX_TIMEOUT = EVENT0*       (1.8029)      *26/26Meg = 117.9ms
*/
    sidle();

    spi_write_register(MCSM0, 0x18); //FS Autocalibration
    spi_write_register(MCSM2, 0x01); //MCSM2.RX_TIME = 1b

    // configure EVENT0 time
    spi_write_register(WOREVT1, 0xFF); //High byte Event0 timeout
    spi_write_register(WOREVT0, 0x7F); //Low byte Event0 timeout

    // configure EVENT1 time
    spi_write_register(WORCTRL, 0x78); //WOR_RES=0b; tEVENT1=0111b=48d -> 48*(750/26MHz)= 1.385ms

    spi_write_strobe(SFRX);    //flush RX buffer
    spi_write_strobe(SWORRST); //resets the WOR timer to the programmed Event 1
    spi_write_strobe(SWOR);    //put the radio in WOR mode when CSn is released

    __delay_cycles(100 * CYCLE_PER_US);
}
//-------------------------------[end]------------------------------------------

//------------------------[disable WOR Mode]-------------------------------------
void wor_disable()
{
    sidle();                         //exit WOR Mode
    spi_write_register(MCSM2, 0x07); //stay in RX. No RX timeout
}
//-------------------------------[end]------------------------------------------

//------------------------[resets WOR Timer]------------------------------------
void wor_reset()
{
    sidle();                         //go to IDLE
    spi_write_register(MCSM2, 0x01); //MCSM2.RX_TIME = 1b
    spi_write_strobe(SFRX);          //flush RX buffer
    spi_write_strobe(SWORRST);       //resets the WOR timer to the programmed Event 1
    spi_write_strobe(SWOR);          //put the radio in WOR mode when CSn is released

    __delay_cycles(100 * CYCLE_PER_US);
}
//-------------------------------[end]------------------------------------------

//-------------------------[tx_payload_burst]-----------------------------------
uint8_t tx_payload_burst(uint8_t rx_addr, uint8_t *txbuffer, uint8_t pktlen)
{


    txbuffer[0] = pktlen - 1;   // This byte is not included (according to the document)
    txbuffer[1] = rx_addr;

    spi_write_burst(TXFIFO_BURST, txbuffer, pktlen); //writes TX_Buffer +1 because of pktlen must be also transfered

    if (debug_level > 0)
    {
        print2uart("TX_FIFO: ");
        for (uint8_t i = 0; i < pktlen; i++) //TX_fifo debug out
        {
            print2uart("%x ", txbuffer[i]);
        }
        print2uart("\n");
    }
    return TRUE;
}
//-------------------------------[end]------------------------------------------

//------------------[rx_payload_burst - package received]-----------------------
uint8_t rx_payload_burst(uint8_t rxbuffer[], uint8_t *pktlen)
{
    uint8_t res = FALSE;

    uint8_t bytes_in_RXFIFO = spi_read_register(RXBYTES); //reads the number of bytes in RXFIFO

    if ((bytes_in_RXFIFO & 0x7F) && !(bytes_in_RXFIFO & 0x80)) //if bytes in buffer and no RX Overflow
    {
        spi_read_burst(RXFIFO_BURST, rxbuffer, bytes_in_RXFIFO);
        *pktlen = rxbuffer[0];
        if (*pktlen <= 0) // incorrect packet format
        {
            if (debug_level > 0)
            {
                print2uart("Error: Misconfigured packet with pktlen = 0\n");
            }
            res = FALSE;
        }
        res = TRUE;
    }
    else
    {
        if (debug_level > 0)
        {
            print2uart("no bytes in RX buffer or RX Overflow!: %x\n", bytes_in_RXFIFO);
        }
        sidle(); //set to IDLE
        spi_write_strobe(SFRX);
        __delay_cycles(100 * CYCLE_PER_US);
        receive(); //set to receive mode
        res = FALSE;
    }

    return res;
}
//-------------------------------[end]------------------------------------------

//---------------------------[send packet]--------------------------------------
uint8_t send_packet(uint8_t rx_addr, uint8_t *txbuffer,
                    uint8_t pktlen, uint8_t tx_retries)
{
    taskENTER_CRITICAL();
    // uint8_t pktlen_ack; //default package len for ACK
    // uint8_t rxbuffer[FIFOBUFFER];
    uint8_t tx_retries_count = 0;
    // uint8_t from_src_addr;
    // uint16_t ackWaitCounter = 0;

    if (pktlen > (FIFOBUFFER - 1)) //FIFO overflow check
    {
        print2uart("ERROR: FIFO overflow");
        return FALSE;
    }

    //do //send package out with retries
    //{

    tx_payload_burst(rx_addr, txbuffer, pktlen); //loads the data in CC1101 buffer
    transmit();                                           //sends data over air
    receive();                                            //receive mode

    vTaskDelay(rand() % 6 * 100);
    taskEXIT_CRITICAL();

    return TRUE;

        // ackWaitCounter = 0;                                     //resets the ACK_Timeout
        // tx_retries_count++;                                     //increase tx retry counter

    //} while (tx_retries_count <= tx_retries); //while count of retries is reaches

    //return FALSE; //send failed. too many retries
}

/* no FreeRTOS, no critical sections */
uint8_t send_packet_no_rtos(uint8_t rx_addr, uint8_t *txbuffer,
                    uint8_t pktlen, uint8_t tx_retries)
{
    uint8_t tx_retries_count = 0;

    if (pktlen > (FIFOBUFFER - 1)) //FIFO overflow check
    {
        print2uart("ERROR: FIFO overflow");
        return FALSE;
    }

    tx_payload_burst(rx_addr, txbuffer, pktlen); //loads the data in CC1101 buffer
    transmit_no_rtos();                                           //sends data over air
    receive();                                            //receive mode

