EMCLab-Sinica/Intermittent-Distributed/Connectivity/CC1101_MSP430.c
    return TRUE;
}
//-------------------------------[end]------------------------------------------

//--------------------------[send ACKNOWLEDGE]------------------------------------
void send_acknowledge(uint8_t my_addr, uint8_t tx_addr)
{
    uint8_t pktlen = 0x06;   //complete Pktlen for ACK packet
    uint8_t tx_buffer[0x06]; //tx buffer array init

    tx_buffer[3] = 'A';
    tx_buffer[4] = 'c';
    tx_buffer[5] = 'k'; //fill buffer with ACK Payload

    tx_payload_burst(tx_addr, tx_buffer, pktlen); //load payload to CC1101
    transmit();                                            //send package over the air
    receive();                                             //set CC1101 in receive mode

    if (debug_level > 0)
    { //debut output
        // Serial.println(F("Ack_send!"));
    }
}
//-------------------------------[end]------------------------------------------
//----------------------[check if Packet is received]---------------------------
uint8_t packet_available()
{
    if (GDO2_PIN_IS_HIGH()) //if RF package received
    {
        print2uart("Packet Available\n");
        if (spi_read_register(IOCFG2) == 0x06) //if sync word detect mode is used
        {
            while (GDO2_PIN_IS_HIGH())
            { //wait till sync word is fully received
                //// Serial.println(F("!"));
            }
        }

        if (debug_level > 0)
        {
            //// Serial.println("Pkt->:");
        }
        return TRUE;
    }
    return FALSE;
}
//-------------------------------[end]------------------------------------------

//------------------[check Payload for ACK or Data]-----------------------------
uint8_t get_packet(uint8_t rxbuffer[], uint8_t *pktlen, uint8_t *dest_addr, uint8_t *src_addr)
{
    taskENTER_CRITICAL();
    rx_fifo_erase(rxbuffer); //delete rx_fifo bufffer

    if (rx_payload_burst(rxbuffer, pktlen) == FALSE) //read package in buffer
    {
        rx_fifo_erase(rxbuffer); //delete rx_fifo bufffer
        taskEXIT_CRITICAL();
        return FALSE;            //exit
    }
    else
    {
        *dest_addr = rxbuffer[1];
        *src_addr = rxbuffer[2];

        if (check_acknowledge(rxbuffer, *pktlen, *src_addr, *dest_addr) == TRUE) //acknowlage received?
        {
            rx_fifo_erase(rxbuffer); //delete rx_fifo bufffer
            taskEXIT_CRITICAL();
            return FALSE;            //Ack received -> finished
        }
        else //real data, and send acknowladge
        {
            if (debug_level > 0)
            {                                         //debug output messages
                if (rxbuffer[1] == BROADCAST_ADDRESS) //if my receiver address is BROADCAST_ADDRESS
                {
                    print2uart("BROADCAST message\n");
                }

                print2uart("pktlen: %d, RX_FIFO: ", *pktlen);
                for (uint8_t i = 0; i < *pktlen + 1; i++) //showes rx_buffer for debug
                {
                    print2uart("%x ", rxbuffer[i]);
                }
                print2uart("\n");
            }

            // send ACK

            // *dest_addr = rxbuffer[1]; //set receiver address to my_addr
            // *src_addr = rxbuffer[2];  //set from_src_addr address

            // if (*dest_addr != BROADCAST_ADDRESS) //send only ack if no BROADCAST_ADDRESS
            // {
            //     print2uart("\nSending %d ACK\n", *dest_addr);
            //     send_acknowledge(*dest_addr, *src_addr); //sending acknowledge to src_addr!
            // }

            taskEXIT_CRITICAL();
            return TRUE;
        }
        taskEXIT_CRITICAL();
        return FALSE;
    }
}
//-------------------------------[end]------------------------------------------

//-------------------------[check ACKNOWLEDGE]------------------------------------
uint8_t check_acknowledge(uint8_t *rxbuffer, uint8_t pktlen, uint8_t src_addr, uint8_t my_addr)
{
    int8_t rssi_dbm;
    uint8_t crc, lqi;

    if ((pktlen == 0x05 &&
         (rxbuffer[1] == my_addr || rxbuffer[1] == BROADCAST_ADDRESS)) &&
        rxbuffer[2] == src_addr &&
        rxbuffer[3] == 'A' && rxbuffer[4] == 'c' && rxbuffer[5] == 'k') //acknowledge received!
    {
        if (rxbuffer[1] == BROADCAST_ADDRESS)
        { //if receiver address BROADCAST_ADDRESS skip acknowledge
            if (debug_level > 0)
            {
                // Serial.println(F("BROADCAST ACK"));
            }
            return FALSE;
        }
        rssi_dbm = rssi_convert(rxbuffer[pktlen + 1]);
        lqi = lqi_convert(rxbuffer[pktlen + 2]);
        crc = check_crc(lqi);

        if (debug_level > 0)
        {
            //// Serial.println();
            // Serial.print(F("ACK! "));
            // Serial.print(F("RSSI:"));uart_puti(rssi_dbm);// Serial.print(F(" "));
            // Serial.print(F("LQI:"));uart_puthex_byte(lqi);// Serial.print(F(" "));
            // Serial.print(F("CRC:"));uart_puthex_byte(crc);
            // Serial.println();
        }
        return TRUE;
    }
    return FALSE;
}
//-------------------------------[end]------------------------------------------

//------------[check if Packet is received within defined time in ms]-----------
uint8_t wait_for_packet(uint16_t milliseconds)
{
    for (uint16_t i = 0; i < milliseconds; i++)
    {
        __delay_cycles(1000 * CYCLE_PER_US);
        if (packet_available())
        {
            return TRUE;
        }
    }
    //// Serial.println(F("no packet received!"));
    return FALSE;
}
//-------------------------------[end]------------------------------------------

//--------------------------[tx_fifo_erase]-------------------------------------
void tx_fifo_erase(uint8_t *txbuffer)
{
    memset(txbuffer, 0, sizeof(FIFOBUFFER)); //erased the TX_fifo array content to "0"
}
//-------------------------------[end]------------------------------------------

//--------------------------[rx_fifo_erase]-------------------------------------
void rx_fifo_erase(uint8_t *rxbuffer)
{
    memset(rxbuffer, 0, sizeof(FIFOBUFFER)); //erased the RX_fifo array content to "0"
}
//-------------------------------[end]------------------------------------------

//------------------------[set CC1101 address]----------------------------------
void set_myaddr(uint8_t addr)
{
    spi_write_register(ADDR, addr); //stores MyAddr in the CC1101
}
//-------------------------------[end]------------------------------------------

