EMCLab-Sinica/Intermittent-Distributed/Connectivity/CC1101_MSP430.c
//---------------------------[set channel]--------------------------------------
void set_channel(uint8_t channel)
{
    spi_write_register(CHANNR, channel); //stores the new channel # in the CC1101
}
//-------------------------------[end]------------------------------------------

//-[set modulation mode 1 = GFSK_1_2_kb; 2 = GFSK_38_4_kb; 3 = GFSK_100_kb; 4 = MSK_250_kb; 5 = MSK_500_kb; 6 = OOK_4_8_kb]-
void set_mode(uint8_t mode)
{
    switch (mode)
    {
    case 0x01:
        spi_write_burst(WRITE_BURST, (uint8_t *)CC1101_GFSK_1_2_kb, CFG_REGISTER); //writes all 47 config register
        break;
    case 0x02:
        spi_write_burst(WRITE_BURST, (uint8_t *)CC1101_GFSK_38_4_kb, CFG_REGISTER); //writes all 47 config register
        break;
    case 0x03:
        spi_write_burst(WRITE_BURST, (uint8_t *)CC1101_GFSK_100_kb, CFG_REGISTER);
        break;
    case 0x04:
        spi_write_burst(WRITE_BURST, (uint8_t *)CC1101_MSK_250_kb, CFG_REGISTER);
        break;
    case 0x05:
        spi_write_burst(WRITE_BURST, (uint8_t *)CC1101_MSK_500_kb, CFG_REGISTER);
        break;
    case 0x06:
        spi_write_burst(WRITE_BURST, (uint8_t *)CC1101_OOK_4_8_kb, CFG_REGISTER);
        break;
    default:
        spi_write_burst(WRITE_BURST, (uint8_t *)CC1101_GFSK_38_4_kb, CFG_REGISTER);
        mode = 0x02;
        break;
    }
}
//-------------------------------[end]------------------------------------------

//---------[set ISM Band 1=315MHz; 2=433MHz; 3=868MHz; 4=915MHz]----------------
void set_ISM(uint8_t ism_freq)
{
    uint8_t freq2, freq1, freq0;

    switch (ism_freq) //loads the RF freq which is defined in CC1101_freq_select
    {
    case 0x01: //315MHz
        freq2 = 0x0C;
        freq1 = 0x1D;
        freq0 = 0x89;
        spi_write_register(FREQ2, freq2); //stores the new freq setting for defined ISM band
        spi_write_register(FREQ1, freq1);
        spi_write_register(FREQ0, freq0);
        spi_write_burst(PATABLE_BURST, (uint8_t *)patable_power_315, 8); //writes output power settings to CC1101

        break;
    case 0x02: //433.92MHz
        freq2 = 0x10;
        freq1 = 0xB0;
        freq0 = 0x71;
        spi_write_register(FREQ2, freq2); //stores the new freq setting for defined ISM band
        spi_write_register(FREQ1, freq1);
        spi_write_register(FREQ0, freq0);
        spi_write_burst(PATABLE_BURST, (uint8_t *)patable_power_433, 8); //writes output power settings to CC1101

        break;
    case 0x03: //868.3MHz
        freq2 = 0x21;
        freq1 = 0x65;
        freq0 = 0x6A;
        spi_write_register(FREQ2, freq2); //stores the new freq setting for defined ISM band
        spi_write_register(FREQ1, freq1);
        spi_write_register(FREQ0, freq0);
        spi_write_burst(PATABLE_BURST, (uint8_t *)patable_power_868, 8); //writes output power settings to CC1101

        break;
    case 0x04: //915MHz
        freq2 = 0x23;
        freq1 = 0x31;
        freq0 = 0x3B;
        spi_write_register(FREQ2, freq2); //stores the new freq setting for defined ISM band
        spi_write_register(FREQ1, freq1);
        spi_write_register(FREQ0, freq0);
        spi_write_burst(PATABLE_BURST, (uint8_t *)patable_power_915, 8); //writes output power settings to CC1101

        break;

    default: //default is 868.3MHz
        freq2 = 0x21;
        freq1 = 0x65;
        freq0 = 0x6A;
        spi_write_register(FREQ2, freq2); //stores the new freq setting for defined ISM band
        spi_write_register(FREQ1, freq1);
        spi_write_register(FREQ0, freq0);
        spi_write_burst(PATABLE_BURST, (uint8_t *)patable_power_868, 8); //writes output power settings to CC1101

        ism_freq = 0x03;
        break;
    }
}
//-------------------------------[end]------------------------------------------

//--------------------------[set frequency]-------------------------------------
/*
void set_freq(uint32_t freq)
{

    // this is split into 3 bytes that are written to 3 different registers on the CC1101
    uint32_t reg_freq = freq / (26000000>>16);

    uint8_t freq2 = (reg_freq>>16) & 0xFF;   // high byte, bits 7..6 are always 0 for this register
    uint8_t freq1 = (reg_freq>>8) & 0xFF;    // middle byte
    uint8_t freq0 = reg_freq & 0xFF;         // low byte

    // Serial.print(F("FREQ2:"));// Serial.println(freq2);
    // Serial.print(F("FREQ1:"));// Serial.println(freq1);
    // Serial.print(F("FREQ0:"));// Serial.println(freq0);

    spi_write_register(FREQ2,freq2);                                         //stores the new freq setting for defined ISM band
    spi_write_register(FREQ1,freq1);
    spi_write_register(FREQ0,freq0);

}
*/
//-------------------------------[end]------------------------------------------

//---------------------------[set PATABLE]--------------------------------------
void set_patable(uint8_t *patable_arr)
{
    spi_write_burst(PATABLE_BURST, patable_arr, 8); //writes output power settings to CC1101    "104us"
}
//-------------------------------[end]------------------------------------------

//-------------------------[set output power]-----------------------------------
void set_output_power_level(int8_t dBm)
{
    uint8_t pa = 0xC0;

    if (dBm <= -30)
        pa = 0x00;
    else if (dBm <= -20)
        pa = 0x01;
    else if (dBm <= -15)
        pa = 0x02;
    else if (dBm <= -10)
        pa = 0x03;
    else if (dBm <= 0)
        pa = 0x04;
    else if (dBm <= 5)
        pa = 0x05;
    else if (dBm <= 7)
        pa = 0x06;
    else if (dBm <= 10)
        pa = 0x07;

    spi_write_register(FREND0, pa);
}
//-------------------------------[end]------------------------------------------

//-------[set Modulation type 2-FSK=0; GFSK=1; ASK/OOK=3; 4-FSK=4; MSK=7]------
void set_modulation_type(uint8_t cfg)
{
    uint8_t data;
    data = spi_read_register(MDMCFG2);
    data = (data & 0x8F) | (((cfg) << 4) & 0x70);
    spi_write_register(MDMCFG2, data);
    //// Serial.printl("MDMCFG2: 0x")
    //// Serial.println(data);
}
//-------------------------------[end]-----------------------------------------

//------------------------[set preamble Len]-----------------------------------
void set_preamble_len(uint8_t cfg)
{
    uint8_t data;
    data = spi_read_register(MDMCFG1);
    data = (data & 0x8F) | (((cfg) << 4) & 0x70);
    spi_write_register(MDMCFG1, data);
    //// Serial.printl("MDMCFG2: 0x");
    //// Serial.println(data);
}
//-------------------------------[end]-----------------------------------------

//-------------------[set modem datarate and deviant]--------------------------
void set_datarate(uint8_t mdmcfg4, uint8_t mdmcfg3, uint8_t deviant)
{
    spi_write_register(MDMCFG4, mdmcfg4);
    spi_write_register(MDMCFG3, mdmcfg3);
    spi_write_register(DEVIATN, deviant);
}
//-------------------------------[end]-----------------------------------------

//----------------------[set sync mode no sync=0;]-----------------------------
void set_sync_mode(uint8_t cfg)
{
    uint8_t data;
    data = spi_read_register(MDMCFG2);
    data = (data & 0xF8) | (cfg & 0x07);
    spi_write_register(MDMCFG2, data);
    //// Serial.println("MDMCFG2: 0x%02X\n", data);
}
//-------------------------------[end]-----------------------------------------

//---------------[set FEC ON=TRUE; OFF=FALSE]----------------------------------
void set_fec(uint8_t cfg)
{
    uint8_t data;
    data = spi_read_register(MDMCFG1);
    data = (data & 0x7F) | (((cfg) << 7) & 0x80);
    spi_write_register(MDMCFG1, data);
    // Serial.print("MDMCFG1: 0x");
    // Serial.println(data);
}
//-------------------------------[end]------------------------------------------

//---------------[set data_whitening ON=TRUE; OFF=FALSE]------------------------
void set_data_whitening(uint8_t cfg)
{
    uint8_t data;
    data = spi_read_register(PKTCTRL0);
    data = (data & 0xBF) | (((cfg) << 6) & 0x40);
    spi_write_register(PKTCTRL0, data);
    //// Serial.print("PKTCTRL0: 0x");
    //// Serial.println(data);
}
//-------------------------------[end]-----------------------------------------

//------------[set manchester encoding ON=TRUE; OFF=FALSE]---------------------
void set_manchester_encoding(uint8_t cfg)
{
    uint8_t data;
    data = spi_read_register(MDMCFG2);
    data = (data & 0xF7) | (((cfg) << 3) & 0x08);
    spi_write_register(MDMCFG2, data);
    //// Serial.print("MDMCFG2: 0x");
    //// Serial.println(data);
}
//-------------------------------[end]------------------------------------------

