EMCLab-Sinica/Intermittent-Distributed/Connectivity/CC1101_MSP430.c
//--------------------------[rssi_convert]--------------------------------------
int8_t rssi_convert(uint8_t Rssi_hex)
{
    int8_t rssi_dbm;
    int16_t Rssi_dec;

    Rssi_dec = Rssi_hex; //convert unsigned to signed

    if (Rssi_dec >= 128)
    {
        rssi_dbm = ((Rssi_dec - 256) / 2) - RSSI_OFFSET_868MHZ;
    }
    else
    {
        if (Rssi_dec < 128)
        {
            rssi_dbm = ((Rssi_dec) / 2) - RSSI_OFFSET_868MHZ;
        }
    }
    return rssi_dbm;
}
//-------------------------------[end]------------------------------------------

//----------------------------[lqi convert]-------------------------------------
uint8_t lqi_convert(uint8_t lqi)
{
    return (lqi & 0x7F);
}
//-------------------------------[end]------------------------------------------

//----------------------------[check crc]---------------------------------------
uint8_t check_crc(uint8_t lqi)
{
    return (lqi & 0x80);
}
//-------------------------------[end]------------------------------------------

/*
//----------------------------[get temp]----------------------------------------
uint8_t get_temp(uint8_t *ptemp_Arr)
{
    const uint8_t num_samples = 8;
    uint16_t adc_result = 0;
    uint32_t temperature = 0;

    sidle();                              //sets CC1101 into IDLE
    spi_write_register(PTEST,0xBF);       //enable temp sensor
    delay(50);                            //wait a bit

    for(uint8_t i=0;i<num_samples;i++)    //sampling analog temperature value
    {
        adc_result += analogRead(GDO0);
        delay(1);
    }
    adc_result = adc_result / num_samples;
    //// Serial.println(adc_result);

    temperature = (adc_result * CC1101_TEMP_ADC_MV) / CC1101_TEMP_CELS_CO;

    ptemp_Arr[0] = temperature / 10;      //cut last digit
    ptemp_Arr[1] = temperature % 10;      //isolate last digit

    if(debug_level > 0){
        // Serial.print(F("Temp:"));// Serial.print(ptemp_Arr[0]);// Serial.print(F("."));// Serial.println(ptemp_Arr[1]);
    }

    spi_write_register(PTEST,0x7F);       //writes 0x7F back to PTest (app. note)

    receive();
    return (*ptemp_Arr);
}
//-------------------------------[end]------------------------------------------
*/

//|==================== SPI Initialisation for CC1101 =========================|
void spi_init_interface(void)
{

    //|--- Activating the SPI interface of MSP430--------|
    //|--- The Macros are defined in pins.h -------------|

    /* configure all SPI related pins */
    SPI_DRIVE_CSN_HIGH();
    SPI_CONFIG_CSN_PIN_AS_OUTPUT();
    SPI_CONFIG_SCLK_PIN_AS_OUTPUT();
    SPI_CONFIG_SI_PIN_AS_OUTPUT();
    SPI_CONFIG_SO_PIN_AS_INPUT();

    SPI_DRIVE_CSN_HIGH();
    SPI_INIT();
}
//-------------------------------[end]------------------------------------------

void spi_init_GDO()
{
    CONFIG_GDO0_PIN_AS_INPUT();
    CONFIG_GDO2_PIN_AS_INPUT();
    // GPIO_setAsInputPin(GPIO_PORT_P8, GPIO_PIN1 | GPIO_PIN2);
    // GPIO_setAsInputPinWithPullDownResistor(GPIO_PORT_P8, GPIO_PIN1 | GPIO_PIN2);
    // GPIO_enableInterrupt(GPIO_PORT_P8, GPIO_PIN1 | GPIO_PIN2);
    // GPIO_selectInterruptEdge(GPIO_PORT_P8, GPIO_PIN1 | GPIO_PIN2, GPIO_LOW_TO_HIGH_TRANSITION);
}

//|============================= SPI Transmission =============================|
uint8_t spi_putc(uint8_t data)
{

    SPI_WRITE_BYTE(data);
    SPI_WAIT_DONE();
    uint8_t statusByte = SPI_READ_BYTE();

    return statusByte;
}
//|==================== schreibe strobe command  ==============================|
void spi_write_strobe(uint8_t spi_instr)
{
    SPI_DRIVE_CSN_LOW(); // CS low
    while (SPI_SO_IS_HIGH())
        ; // Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr);
    SPI_DRIVE_CSN_HIGH(); // CS high
}
//|======================= Read status byte ==================================|
/*
uint8_t spi_read_status(uint8_t spi_instr)
{
    SPI_DRIVE_CSN_LOW();          // CS low
    while (SPI_SO_IS_HIGH());  // Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | Read_burst);
    spi_instr = spi_putc(0xFF);
    SPI_DRIVE_CSN_HIGH();         // CS high

    return spi_instr;
}
*/
//|========================== Read registers ==============================|
uint8_t spi_read_register(uint8_t spi_instr)
{
    SPI_DRIVE_CSN_LOW(); // CS low
    while (SPI_SO_IS_HIGH())
        ; // Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | READ_SINGLE_BYTE);
    spi_instr = spi_putc(0xFF);
    SPI_DRIVE_CSN_HIGH(); // CS high

    return spi_instr;
}
//|========== Read multiple registers in burst mode ========|
void spi_read_burst(uint8_t spi_instr, uint8_t *pArr, uint8_t length)
{
    SPI_DRIVE_CSN_LOW(); // CS low
    while (SPI_SO_IS_HIGH())
        ; //Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | READ_BURST);

    for (uint8_t i = 0; i < length; i++)
    {
        pArr[i] = spi_putc(0xFF);
    }

    SPI_DRIVE_CSN_HIGH();
}
//|======================= Write registers =============================|
void spi_write_register(uint8_t spi_instr, uint8_t value)
{
    SPI_DRIVE_CSN_LOW(); // CS low
    while (SPI_SO_IS_HIGH())
        ; //Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | WRITE_SINGLE_BYTE);
    spi_putc(value);
    SPI_DRIVE_CSN_HIGH();
}
//|======= Write multiple registers in burst mode =======|
void spi_write_burst(uint8_t spi_instr, uint8_t *pArr, uint8_t length)
{
    SPI_DRIVE_CSN_LOW(); // CS low
    while (SPI_SO_IS_HIGH())
        ; //Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | WRITE_BURST);

    for (uint8_t i = 0; i < length; i++)
    {
        spi_putc(pArr[i]);
    }

    SPI_DRIVE_CSN_HIGH();
}
//|=================================== END ====================================|

